In [228]:
import pandas as pd
import numpy as np

In [266]:
#task 1
project_data = {
    "ID": ["A001","A002","A003","A004","A005","A002","A005","A003","A001","A003","A001","A004","A004","A005"],
    "Project": ["Project 1","Project 2","Project 3","Project 4","Project 5","Project 6","Project 7","Project 8","Project 9","Project 10","Project 11","Project 12","Project 13","Project 14" ],
    "Cost": [1002000, 2000000, 4500000, 5500000, None,680000,400000, 350000, None,300000,2000000,1000000,3000000,200000],
    "Status": ["Finished", "Ongoing", "Finished","Ongoing","Finished","Failed","Finished","Failed","Ongoing","Finished","Failed","Ongoing","Finished","Finished"]
}

In [268]:
project_df = pd.DataFrame(project_data)
project_df.to_csv("project_dataframe.csv", index=False)

In [298]:
employee_data ={
    "ID": ["A001","A002","A003","A004","A005"],
    "Name": ["John Alter", "Alice Luxemburg", "Tom Sabestine", "Nina Adgra", "Amy Johny"],
    "Gender": ["M", "F", "M", "F", "F"],
    "City": ["Paris", "London", "Berlin", "Newyork", "Madrid"],
    "Age": [25, 27, 29, 31, 30]
}

In [300]:
employee_df = pd.DataFrame(employee_data)
employee_df.to_csv("employee_dataframe.csv", index =False)

In [301]:
seniority_data ={
    "ID": ["A001", "A002", "A003", "A004", "A005"],
    "Designation Level": [2, 2, 3, 2, 3]
}

In [303]:
seniority_df = pd.DataFrame(seniority_data)
seniority_df.to_csv("seniority_dataframe.csv", index=False)

In [305]:
#task 2
running_sum = 0
running_count = 0

# filling the missing values in Cost column
for index, row in project_df.iterrows():
    if pd.notna(row['Cost']):
        running_sum += row['Cost']
        running_count += 1
    else:
        if running_count > 0:
            running_average = running_sum / running_count 
            project_df.at[index, 'Cost'] = running_average
        else:
            project_df.at[index, 'Cost']= 0
project_df['Cost'] = project_df['Cost'].apply(lambda x: int(x))

In [306]:
print(project_df)

      ID     Project     Cost    Status
0   A001   Project 1  1002000  Finished
1   A002   Project 2  2000000   Ongoing
2   A003   Project 3  4500000  Finished
3   A004   Project 4  5500000   Ongoing
4   A005   Project 5  3250500  Finished
5   A002   Project 6   680000    Failed
6   A005   Project 7   400000  Finished
7   A003   Project 8   350000    Failed
8   A001   Project 9  2061714   Ongoing
9   A003  Project 10   300000  Finished
10  A001  Project 11  2000000    Failed
11  A004  Project 12  1000000   Ongoing
12  A004  Project 13  3000000  Finished
13  A005  Project 14   200000  Finished

In [308]:
#task 3

#this will split the name column
employee_df[['First Name', ' Last Name']] = employee_df['Name'].str.split(' ', n=1, expand= True)
# this code will drop the name column
employee_df = employee_df.drop('Name', axis=1)

In [312]:
print(employee_df)

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxemburg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [314]:
#task 4

#merging all the data as final:
merged_df = pd.merge(employee_df, seniority_df, on="ID")
final_df = pd.merge(merged_df, project_df, on="ID")

In [316]:
print(final_df)

      ID Gender     City  Age First Name  Last Name  Designation Level  \
0   A001      M    Paris   25       John      Alter                  2
1   A001      M    Paris   25       John      Alter                  2
2   A001      M    Paris   25       John      Alter                  2
3   A002      F   London   27      Alice  Luxemburg                  2
4   A002      F   London   27      Alice  Luxemburg                  2
5   A003      M   Berlin   29        Tom  Sabestine                  3
6   A003      M   Berlin   29        Tom  Sabestine                  3
7   A003      M   Berlin   29        Tom  Sabestine                  3
8   A004      F  Newyork   31       Nina      Adgra                  2
9   A004      F  Newyork   31       Nina      Adgra                  2
10  A004      F  Newyork   31       Nina      Adgra                  2
11  A005      F   Madrid   30        Amy      Johny                  3
12  A005      F   Madrid   30        Amy      Johny                  3
13  A005      F   Madrid   30        Amy      Johny                  3

       Project     Cost    Status
0    Project 1  1002000  Finished
1    Project 9  2061714   Ongoing
2   Project 11  2000000    Failed
3    Project 2  2000000   Ongoing
4    Project 6   680000    Failed
5    Project 3  4500000  Finished
6    Project 8   350000    Failed
7   Project 10   300000  Finished
8    Project 4  5500000   Ongoing
9   Project 12  1000000   Ongoing
10  Project 13  3000000  Finished
11   Project 5  3250500  Finished
12   Project 7   400000  Finished
13  Project 14   200000  Finished

In [318]:
#task 5
#adding bonus column in the final dataframe

final_df['Bonus']= final_df.apply(
    lambda row: 0.05 * row['Cost'] if row['Status'] == 'Finished' else 0,
    axis=1
)
print(final_df)

      ID Gender     City  Age First Name  Last Name  Designation Level  \
0   A001      M    Paris   25       John      Alter                  2
1   A001      M    Paris   25       John      Alter                  2
2   A001      M    Paris   25       John      Alter                  2
3   A002      F   London   27      Alice  Luxemburg                  2
4   A002      F   London   27      Alice  Luxemburg                  2
5   A003      M   Berlin   29        Tom  Sabestine                  3
6   A003      M   Berlin   29        Tom  Sabestine                  3
7   A003      M   Berlin   29        Tom  Sabestine                  3
8   A004      F  Newyork   31       Nina      Adgra                  2
9   A004      F  Newyork   31       Nina      Adgra                  2
10  A004      F  Newyork   31       Nina      Adgra                  2
11  A005      F   Madrid   30        Amy      Johny                  3
12  A005      F   Madrid   30        Amy      Johny                  3
13  A005      F   Madrid   30        Amy      Johny                  3

       Project     Cost    Status     Bonus
0    Project 1  1002000  Finished   50100.0
1    Project 9  2061714   Ongoing       0.0
2   Project 11  2000000    Failed       0.0
3    Project 2  2000000   Ongoing       0.0
4    Project 6   680000    Failed       0.0
5    Project 3  4500000  Finished  225000.0
6    Project 8   350000    Failed       0.0
7   Project 10   300000  Finished   15000.0
8    Project 4  5500000   Ongoing       0.0
9   Project 12  1000000   Ongoing       0.0
10  Project 13  3000000  Finished  150000.0
11   Project 5  3250500  Finished  162525.0
12   Project 7   400000  Finished   20000.0
13  Project 14   200000  Finished   10000.0

In [320]:
#task 6
#demote the designation level by 1, whose projects have status failed

final_df.loc[final_df['Status'] == "Failed", 'Designation Level'] -=1
final_df['Designation Level'] = final_df['Designation Level'].clip(lower=1)

final_df = final_df[final_df['Designation Level'] <= 4]

print(final_df)

      ID Gender     City  Age First Name  Last Name  Designation Level  \
0   A001      M    Paris   25       John      Alter                  2
1   A001      M    Paris   25       John      Alter                  2
2   A001      M    Paris   25       John      Alter                  1
3   A002      F   London   27      Alice  Luxemburg                  2
4   A002      F   London   27      Alice  Luxemburg                  1
5   A003      M   Berlin   29        Tom  Sabestine                  3
6   A003      M   Berlin   29        Tom  Sabestine                  2
7   A003      M   Berlin   29        Tom  Sabestine                  3
8   A004      F  Newyork   31       Nina      Adgra                  2
9   A004      F  Newyork   31       Nina      Adgra                  2
10  A004      F  Newyork   31       Nina      Adgra                  2
11  A005      F   Madrid   30        Amy      Johny                  3
12  A005      F   Madrid   30        Amy      Johny                  3
13  A005      F   Madrid   30        Amy      Johny                  3

       Project     Cost    Status     Bonus
0    Project 1  1002000  Finished   50100.0
1    Project 9  2061714   Ongoing       0.0
2   Project 11  2000000    Failed       0.0
3    Project 2  2000000   Ongoing       0.0
4    Project 6   680000    Failed       0.0
5    Project 3  4500000  Finished  225000.0
6    Project 8   350000    Failed       0.0
7   Project 10   300000  Finished   15000.0
8    Project 4  5500000   Ongoing       0.0
9   Project 12  1000000   Ongoing       0.0
10  Project 13  3000000  Finished  150000.0
11   Project 5  3250500  Finished  162525.0
12   Project 7   400000  Finished   20000.0
13  Project 14   200000  Finished   10000.0

In [328]:
#task 7
# add Mr and Mrs to first name

final_df.loc[final_df['Gender'] == 'Male', 'First Name'] = 'Mr. ' + final_df['First Name']
final_df.loc[final_df['Gender'] == 'Female', 'First Name'] = 'Mrs. ' + final_df['First Name']

final_df = final_df.drop(columns =['Gender'])

print(final_df)

      ID     City  Age First Name  Last Name  Designation Level     Project  \
0   A001    Paris   25       John      Alter                  2   Project 1
1   A001    Paris   25       John      Alter                  2   Project 9
2   A001    Paris   25       John      Alter                  1  Project 11
3   A002   London   27      Alice  Luxemburg                  2   Project 2
4   A002   London   27      Alice  Luxemburg                  1   Project 6
5   A003   Berlin   29        Tom  Sabestine                  3   Project 3
6   A003   Berlin   29        Tom  Sabestine                  2   Project 8
7   A003   Berlin   29        Tom  Sabestine                  3  Project 10
8   A004  Newyork   31       Nina      Adgra                  2   Project 4
9   A004  Newyork   31       Nina      Adgra                  2  Project 12
10  A004  Newyork   31       Nina      Adgra                  2  Project 13
11  A005   Madrid   30        Amy      Johny                  3   Project 5
12  A005   Madrid   30        Amy      Johny                  3   Project 7
13  A005   Madrid   30        Amy      Johny                  3  Project 14

       Cost    Status     Bonus
0   1002000  Finished   50100.0
1   2061714   Ongoing       0.0
2   2000000    Failed       0.0
3   2000000   Ongoing       0.0
4    680000    Failed       0.0
5   4500000  Finished  225000.0
6    350000    Failed       0.0
7    300000  Finished   15000.0
8   5500000   Ongoing       0.0
9   1000000   Ongoing       0.0
10  3000000  Finished  150000.0
11  3250500  Finished  162525.0
12   400000  Finished   20000.0
13   200000  Finished   10000.0

In [260]:
print(final_df.columns)

Index(['ID', 'City', 'Age', 'First Name', ' Last Name', 'Designation Level',
       'Project', 'Cost', 'Status', 'Bonus'],
      dtype='object')

In [332]:
#task 8
#promote designation level by 1

final_df.loc[final_df['Age'] > 29, 'Designation Level'] += 1

print(final_df)

      ID     City  Age First Name  Last Name  Designation Level     Project  \
0   A001    Paris   25       John      Alter                  2   Project 1
1   A001    Paris   25       John      Alter                  2   Project 9
2   A001    Paris   25       John      Alter                  1  Project 11
3   A002   London   27      Alice  Luxemburg                  2   Project 2
4   A002   London   27      Alice  Luxemburg                  1   Project 6
5   A003   Berlin   29        Tom  Sabestine                  3   Project 3
6   A003   Berlin   29        Tom  Sabestine                  2   Project 8
7   A003   Berlin   29        Tom  Sabestine                  3  Project 10
8   A004  Newyork   31       Nina      Adgra                  4   Project 4
9   A004  Newyork   31       Nina      Adgra                  4  Project 12
10  A004  Newyork   31       Nina      Adgra                  4  Project 13
11  A005   Madrid   30        Amy      Johny                  5   Project 5
12  A005   Madrid   30        Amy      Johny                  5   Project 7
13  A005   Madrid   30        Amy      Johny                  5  Project 14

       Cost    Status     Bonus
0   1002000  Finished   50100.0
1   2061714   Ongoing       0.0
2   2000000    Failed       0.0
3   2000000   Ongoing       0.0
4    680000    Failed       0.0
5   4500000  Finished  225000.0
6    350000    Failed       0.0
7    300000  Finished   15000.0
8   5500000   Ongoing       0.0
9   1000000   Ongoing       0.0
10  3000000  Finished  150000.0
11  3250500  Finished  162525.0
12   400000  Finished   20000.0
13   200000  Finished   10000.0

In [336]:
#task 9
#adding the cost of all projects by each employee

TotalProjCost = final_df.groupby(['ID', 'First Name'], as_index=False)['Cost'].sum()
TotalProjCost.rename(columns={'Cost': 'Total Cost'}, inplace=True)

print(TotalProjCost)

     ID First Name  Total Cost
0  A001       John     5063714
1  A002      Alice     2680000
2  A003        Tom     5150000
3  A004       Nina     9500000
4  A005        Amy     3850500

In [338]:
#task 10
# print all the city names which contains the letter "o" in it

filtered_df = final_df[final_df['City'].str.contains('o', case=False, na=False)]

print(filtered_df)

      ID     City  Age First Name  Last Name  Designation Level     Project  \
3   A002   London   27      Alice  Luxemburg                  2   Project 2
4   A002   London   27      Alice  Luxemburg                  1   Project 6
8   A004  Newyork   31       Nina      Adgra                  4   Project 4
9   A004  Newyork   31       Nina      Adgra                  4  Project 12
10  A004  Newyork   31       Nina      Adgra                  4  Project 13

       Cost    Status     Bonus
3   2000000   Ongoing       0.0
4    680000    Failed       0.0
8   5500000   Ongoing       0.0
9   1000000   Ongoing       0.0
10  3000000  Finished  150000.0